<a href="https://colab.research.google.com/github/versant2612/BancosDeDados/blob/main/ENCE/est043/ExemploIMDB_DML.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Base de Dados - EST043 ENCE - Profa. Veronica dos Santos

---

## Comandos INSERT/UPDATE/DELETE para manipulação de tuplas no banco IMDB


---


ANTES de começar,  ❗ **não esquecer** ❗ de, antes de mais nada, SALVAR este notebook no ambiente COLAB no drive da TUA própria conta GOOGLE.

## Preparação: Instalação e Configuração do PostgreSQL

Basta dar PLAY que o script abaixo instalará o SGBD PostgreSQL. Não altere esta célula.

In [77]:

%%capture
# Instalação do PostgreSQL
!sudo apt-get -y -qq update
!pip install sqlalchemy==2.0
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start
# Alterando a senha do usuário padrão 'postgres' para 'postgres'
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

In [78]:
# Carregando a extensão sql para usar o SQL pelo Google Colab
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Criação do database e do esquema com comandos DDL

### Esquema relacional da base de dados Cinema:


Filme (titulo, ano, resumo, pais, duracao, avaliacao)

Pais (sigla, nome)

Artista (nome, sexo, datanascimento)

Genero (nome)

FilmeGenero (titulofilme, ano, nomegenero)

FilmeElenco (titulofilme, ano, nomeartista)

In [153]:
# Criar um banco de dados e dois esquemas

!sudo service postgresql restart
!sudo -u postgres psql -U postgres -c 'DROP DATABASE IF EXISTS est043;'
!sudo -u postgres psql -U postgres -c 'CREATE DATABASE est043;'
!sudo -u postgres psql -U postgres -d est043 -c 'CREATE SCHEMA cinemav1;'
!sudo -u postgres psql -U postgres -d est043 -c 'CREATE SCHEMA cinemav2;'

 * Restarting PostgreSQL 14 database server
   ...done.
DROP DATABASE
CREATE DATABASE
CREATE SCHEMA
CREATE SCHEMA

Faça o upload do arquivo IMDB_CREATE.sql no caminho /content/sample_data/ usando o painel ao lado

In [154]:
#executar script para criação de tabelas nos dois esquemas
%%capture
!PGPASSWORD='postgres' psql -h localhost -U postgres -d est043 -a -f /content/sample_data/IMDB_CREATE.sql

In [155]:
# Configurando o PostgreSQL na variável de ambiente DATABASE_URL
%env DATABASE_URL=postgresql://postgres:postgres@localhost:5432/est043

env: DATABASE_URL=postgresql://postgres:postgres@localhost:5432/est043

Para evitar o erro reportado aqui -> https://community.deeplearning.ai/t/error-while-querying-db-from-jupyter-notebook/716351 é necessário executar o comando abaix:

In [156]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## Incluindo tuplas com o Comando INSERT

In [160]:
%%sql

-- o esquema V1 não tem todas as constraints, setar o esquema aqui para não precisar usar o prefixo.

SET SCHEMA 'cinemav1';

 * postgresql://postgres:***@localhost:5432/est043
Done.

[]

Tentativa de inserir filme antes de carregar países (violação de FK)

In [161]:
%%sql

-- especificando as colunas em uma ordem diferente da estrutura da tabela
INSERT INTO Filme (titulo, ano, pais, duracao, avaliacao, resumo)
VALUES (
'Monty Python em Busca do Cálice Sagrado', 1975,
'UK',
91,
8.3,
'King Arthur and his knights embark on a low-budget search for the Grail, encountering many, very silly obstacles.' );

 * postgresql://postgres:***@localhost:5432/est043
(psycopg2.errors.ForeignKeyViolation) insert or update on table "filme" violates foreign key constraint "filme_pais_fkey"
DETAIL:  Key (pais)=(UK) is not present in table "pais".

[SQL: -- especificando as colunas em uma ordem diferente da estrutura da tabela
INSERT INTO Filme (titulo, ano, pais, duracao, avaliacao, resumo)
VALUES (
'Monty Python em Busca do Cálice Sagrado', 1975,
'UK',
91,
8.3,
'King Arthur and his knights embark on a low-budget search for the Grail, encountering many, very silly obstacles.' );]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [162]:
%%sql

-- carregar países antes de Filmes

INSERT INTO Pais VALUES('US','Estados Unidos');
INSERT INTO Pais VALUES('UK','Reino Unido');
INSERT INTO Pais VALUES('FR','França');

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.
1 rows affected.
1 rows affected.

[]

Inserindo dois filmes com informações completas (valores para todas as colunas).

In [163]:
%%sql

-- especificando as colunas em uma ordem diferente da estrutura da tabela
INSERT INTO Filme (titulo, ano, pais, duracao, avaliacao, resumo)
VALUES (
'Monty Python em Busca do Cálice Sagrado', 1975,
'UK',
91,
8.3,
'King Arthur and his knights embark on a low-budget search for the Grail, encountering many, very silly obstacles.' );

-- sem especificar as colunas onde os valores estão na mesma ordem das colunas da estrutura da tabela
INSERT INTO Filme VALUES (
'As Pontes de Madison', 1995,
'The path of Francesca Johnson seems destined when an unexpected fork in the road causes her to question everything she had come to expect from life.',
'US',
135,
7.3);

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.
1 rows affected.

[]

Visualizar os dados carregados na tabela Filmes

In [164]:
%%sql

SELECT * FROM Filme;

 * postgresql://postgres:***@localhost:5432/est043
2 rows affected.

[('Monty Python em Busca do Cálice Sagrado', 1975, 'King Arthur and his knights embark on a low-budget search for the Grail, encountering many, very silly obstacles.', 'UK', 91, 8.3),
 ('As Pontes de Madison', 1995, 'The path of Francesca Johnson seems destined when an unexpected fork in the road causes her to question everything she had come to expect from life.', 'US', 135, 7.3)]

Inserindo filmes com informações parciais

In [165]:
%%sql

-- insere um filme sem resumo e sem duração.
INSERT INTO Filme (titulo, ano, pais, avaliacao) VALUES ('Contato de Risco',2003,'US',2.4);

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.

[]

In [166]:
%%sql

-- insere filmes apenas contendo título, ano e país.

INSERT INTO Filme (titulo, ano, pais) VALUES ('Caça-Fantasmas',1984, 'US');
INSERT INTO Filme (titulo, ano, pais) VALUES ('Caça-Fantasmas',2016, 'US');
INSERT INTO Filme (titulo, ano, pais) VALUES ('A Família Bélier',2014, 'FR');

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.
1 rows affected.
1 rows affected.

[]

Inserindo um filme utilizando a seguinte ordem das colunas: ano, pais, duracao e titulo.

In [167]:
%%sql

-- inserindo filme com ano, pais, duração e título
INSERT INTO Filme (ano, pais, duracao, titulo) VALUES (2006,'FR', 94,'Meu melhor amigo');

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.

[]

Onde o Colab apresenta como None corresponde ao NULL no valor da coluna

In [168]:
%%sql

SELECT * FROM Filme;

 * postgresql://postgres:***@localhost:5432/est043
7 rows affected.

[('Monty Python em Busca do Cálice Sagrado', 1975, 'King Arthur and his knights embark on a low-budget search for the Grail, encountering many, very silly obstacles.', 'UK', 91, 8.3),
 ('As Pontes de Madison', 1995, 'The path of Francesca Johnson seems destined when an unexpected fork in the road causes her to question everything she had come to expect from life.', 'US', 135, 7.3),
 ('Contato de Risco', 2003, None, 'US', None, 2.4),
 ('Caça-Fantasmas', 1984, None, 'US', None, None),
 ('Caça-Fantasmas', 2016, None, 'US', None, None),
 ('A Família Bélier', 2014, None, 'FR', None, None),
 ('Meu melhor amigo', 2006, None, 'FR', 94, None)]

Tentativa de violar a chave primária.

In [169]:
%%sql

INSERT INTO Filme (titulo, ano, resumo, pais)
VALUES ('As Pontes de Madison',1995, 'Um ótimo filme.', 'US');

 * postgresql://postgres:***@localhost:5432/est043
(psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "filme_pkey"
DETAIL:  Key (titulo, ano)=(As Pontes de Madison, 1995) already exists.

[SQL: INSERT INTO Filme (titulo, ano, resumo, pais)
VALUES ('As Pontes de Madison',1995, 'Um ótimo filme.', 'US');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

inclusão de múltiplas linhas em um único INSERT

In [170]:
%%sql

INSERT INTO Pais VALUES
('IT','Itália'),
('AR','Agentina'),
('NZ','Nova Zelândia');

 * postgresql://postgres:***@localhost:5432/est043
3 rows affected.

[]

Inserindo nas demais tabelas

In [171]:
%%sql

--Pais
INSERT INTO Pais VALUES('BR','Brasil');
INSERT INTO Pais VALUES('US','Estados Unidos');

--Artista
INSERT INTO Artista VALUES('Graham Chapman','M');
INSERT INTO Artista VALUES('John Cleese','M');
INSERT INTO Artista VALUES('Eric Idle','M');
INSERT INTO Artista VALUES('Terry Gilliam','M');
INSERT INTO Artista VALUES('Terry Jones','M');
INSERT INTO Artista VALUES('Michael Palin','M');
INSERT INTO Artista VALUES('Jennifer Lopez','F');
INSERT INTO Artista VALUES('Clint Eastwood','M');
INSERT INTO Artista VALUES('Maryl Streep','F');
INSERT INTO Artista VALUES('Ben Affleck','M');
INSERT INTO Artista VALUES('Milla Jovovich','F');

--Genero
INSERT INTO Genero VALUES('Drama');
INSERT INTO Genero VALUES('Crime');
INSERT INTO Genero VALUES('Comédia');
INSERT INTO Genero VALUES('Aventura');
INSERT INTO Genero VALUES('Fantasia');
INSERT INTO Genero VALUES('Romance');
INSERT INTO Genero VALUES('Biografia');
INSERT INTO Genero VALUES('Sci-Fi');

--Inserindo o Elenco do Filme “As Pontes de Madison”
INSERT INTO FilmeElenco
VALUES('As Pontes de Madison',1995,'Maryl Streep');

INSERT INTO FilmeElenco
VALUES('As Pontes de Madison',1995,'Clint Eastwood');

--Inserindo os Gêneros do Filme “As Pontes de Madison”
INSERT INTO FilmeGenero
VALUES('As Pontes de Madison',1995,'Drama');

INSERT INTO FilmeGenero
VALUES('As Pontes de Madison',1995,'Romance');

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Mudança de esquema para testar outras variações de INSERT múltiplo

In [177]:
%%sql

SET SCHEMA 'cinemav2';

INSERT INTO Pais VALUES
('IT','Itália'),
('AR','Argentina'),
('US','Estados Unidos'),
('NZ','Nova Zelândia');

 * postgresql://postgres:***@localhost:5432/est043
Done.
(psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "pk_sigla"
DETAIL:  Key (sigla)=(IT) already exists.

[SQL: INSERT INTO Pais VALUES
('IT','Itália'),
('AR','Argentina'),
('US','Estados Unidos'),
('NZ','Nova Zelândia');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [173]:
%%sql

SELECT * FROM Pais;

 * postgresql://postgres:***@localhost:5432/est043
4 rows affected.

[('IT', 'Itália'),
 ('AR', 'Argentina'),
 ('US', 'Estados Unidos'),
 ('NZ', 'Nova Zelândia')]

In [174]:
%%sql

SELECT * FROM Filme;

 * postgresql://postgres:***@localhost:5432/est043
0 rows affected.

[]

In [175]:
%%sql

INSERT INTO Filme (titulo, ano, pais, duracao) VALUES
('Caça-Fantasmas', 1984, 'US', NULL),
('Meu melhor amigo', 2006, 'FR', 94);

 * postgresql://postgres:***@localhost:5432/est043
(psycopg2.errors.ForeignKeyViolation) insert or update on table "filme" violates foreign key constraint "fk_pais_filme"
DETAIL:  Key (pais)=(FR) is not present in table "pais".

[SQL: INSERT INTO Filme (titulo, ano, pais, duracao) VALUES
('Caça-Fantasmas', 1984, 'US', NULL),
('Meu melhor amigo', 2006, 'FR', 94);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

A tabela deve contiuar vazia pois o INSERT falhou por violação de FK em uma das tuplas

Um comando aqui = uma transação

In [176]:
%%sql

SELECT * FROM Filme;

 * postgresql://postgres:***@localhost:5432/est043
0 rows affected.

[]

# Excluindo tuplas com o Comando DELETE

Excluindo o Filme “Caça-Fantasmas” de 1984 usando a PK

In [178]:
%%sql

SET SCHEMA 'cinemav1';

SELECT * FROM Filme
WHERE titulo = 'Caça-Fantasmas';

 * postgresql://postgres:***@localhost:5432/est043
Done.
2 rows affected.

[('Caça-Fantasmas', 1984, None, 'US', None, None),
 ('Caça-Fantasmas', 2016, None, 'US', None, None)]

In [179]:
%%sql

DELETE FROM Filme
WHERE titulo = 'Caça-Fantasmas' AND ano = 1984;

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.

[]

In [180]:
%%sql

SELECT * FROM Filme
WHERE titulo = 'Caça-Fantasmas';

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.

[('Caça-Fantasmas', 2016, None, 'US', None, None)]

In [181]:
%%sql

SELECT * FROM Filme
WHERE titulo like '%fantasma%';

 * postgresql://postgres:***@localhost:5432/est043
0 rows affected.

[]

In [182]:
%%sql

SELECT * FROM Filme
WHERE titulo like '%Fantasma%';

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.

[('Caça-Fantasmas', 2016, None, 'US', None, None)]

Tentativa de exclui um Pais e violar FK

In [183]:
%%sql

DELETE FROM Pais
WHERE sigla = 'US';

 * postgresql://postgres:***@localhost:5432/est043
(psycopg2.errors.ForeignKeyViolation) update or delete on table "pais" violates foreign key constraint "filme_pais_fkey" on table "filme"
DETAIL:  Key (sigla)=(US) is still referenced from table "filme".

[SQL: DELETE FROM Pais
WHERE sigla = 'US';]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

Exclusão de Pais sem violar FK

In [184]:
%%sql

DELETE FROM Pais
WHERE sigla = 'IT';

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.

[]

In [185]:
%%sql

SELECT * FROM Pais;

 * postgresql://postgres:***@localhost:5432/est043
6 rows affected.

[('US', 'Estados Unidos'),
 ('UK', 'Reino Unido'),
 ('FR', 'França'),
 ('AR', 'Agentina'),
 ('NZ', 'Nova Zelândia'),
 ('BR', 'Brasil')]

Remoção de todas as tuplas de uma tabela

In [186]:
%%sql

SELECT * FROM cinemav2.Pais;

 * postgresql://postgres:***@localhost:5432/est043
4 rows affected.

[('IT', 'Itália'),
 ('AR', 'Argentina'),
 ('US', 'Estados Unidos'),
 ('NZ', 'Nova Zelândia')]

In [187]:
%%sql

SELECT * FROM cinemav2.Filme;

 * postgresql://postgres:***@localhost:5432/est043
0 rows affected.

[]

In [188]:
%%sql

TRUNCATE TABLE cinemav2.Pais CASCADE;

 * postgresql://postgres:***@localhost:5432/est043
Done.

[]

In [189]:
%%sql

SELECT * FROM cinemav2.Pais;

 * postgresql://postgres:***@localhost:5432/est043
0 rows affected.

[]

In [190]:
%%sql

SELECT * FROM cinemav2.Filme;

 * postgresql://postgres:***@localhost:5432/est043
0 rows affected.

[]

# Modificando tuplas com o Comando UPDATE

Modificando atributos de Filmes

In [191]:
%%sql

SELECT * FROM Filme;

 * postgresql://postgres:***@localhost:5432/est043
6 rows affected.

[('Monty Python em Busca do Cálice Sagrado', 1975, 'King Arthur and his knights embark on a low-budget search for the Grail, encountering many, very silly obstacles.', 'UK', 91, 8.3),
 ('As Pontes de Madison', 1995, 'The path of Francesca Johnson seems destined when an unexpected fork in the road causes her to question everything she had come to expect from life.', 'US', 135, 7.3),
 ('Contato de Risco', 2003, None, 'US', None, 2.4),
 ('Caça-Fantasmas', 2016, None, 'US', None, None),
 ('A Família Bélier', 2014, None, 'FR', None, None),
 ('Meu melhor amigo', 2006, None, 'FR', 94, None)]

In [192]:
%%sql

UPDATE Filme
SET avaliacao = 10
WHERE titulo = 'As Pontes de Madison' AND ano=1995;

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.

[]

In [193]:
%%sql

UPDATE Filme
SET duracao=duracao+2
WHERE duracao BETWEEN 90 AND 150;

 * postgresql://postgres:***@localhost:5432/est043
3 rows affected.

[]

Não funciona coluna = NULL, deve ser testado se coluna IS NULL ou coluna IS NOT NULL

O operador || faz a concatenação de strings (texto)

In [194]:
%%sql

UPDATE Filme
SET resumo = 'Nada a informar sobre ' || titulo
WHERE resumo IS NULL;

 * postgresql://postgres:***@localhost:5432/est043
4 rows affected.

[]

Os valores onde a duração era igual a NULO permanecem já que não é possível fazer conta com NULOS

In [195]:
%%sql

SELECT * FROM Filme;

 * postgresql://postgres:***@localhost:5432/est043
6 rows affected.

[('Monty Python em Busca do Cálice Sagrado', 1975, 'King Arthur and his knights embark on a low-budget search for the Grail, encountering many, very silly obstacles.', 'UK', 93, 8.3),
 ('As Pontes de Madison', 1995, 'The path of Francesca Johnson seems destined when an unexpected fork in the road causes her to question everything she had come to expect from life.', 'US', 137, 10.0),
 ('Contato de Risco', 2003, 'Nada a informar sobre Contato de Risco', 'US', None, 2.4),
 ('Caça-Fantasmas', 2016, 'Nada a informar sobre Caça-Fantasmas', 'US', None, None),
 ('A Família Bélier', 2014, 'Nada a informar sobre A Família Bélier', 'FR', None, None),
 ('Meu melhor amigo', 2006, 'Nada a informar sobre Meu melhor amigo', 'FR', 96, None)]

# Copia de dados (com ou sem copiar estrutura)

Copiar estrutura e dados entre tabelas

In [196]:
%%sql

SET SCHEMA 'cinemav2';

DROP TABLE IF EXISTS FilmeUS;
CREATE TABLE FilmeUS AS
SELECT * FROM cinemav1.Filme WHERE Pais = 'US';

 * postgresql://postgres:***@localhost:5432/est043
Done.
Done.
3 rows affected.

[]

In [197]:
%%sql

SELECT * FROM FilmeUS;

 * postgresql://postgres:***@localhost:5432/est043
3 rows affected.

[('As Pontes de Madison', 1995, 'The path of Francesca Johnson seems destined when an unexpected fork in the road causes her to question everything she had come to expect from life.', 'US', 137, 10.0),
 ('Contato de Risco', 2003, 'Nada a informar sobre Contato de Risco', 'US', None, 2.4),
 ('Caça-Fantasmas', 2016, 'Nada a informar sobre Caça-Fantasmas', 'US', None, None)]

In [198]:
%%sql

UPDATE FilmeUS
SET pais='BR';

 * postgresql://postgres:***@localhost:5432/est043
3 rows affected.

[]

In [199]:
%%sql

SELECT * FROM FilmeUS;

 * postgresql://postgres:***@localhost:5432/est043
3 rows affected.

[('As Pontes de Madison', 1995, 'The path of Francesca Johnson seems destined when an unexpected fork in the road causes her to question everything she had come to expect from life.', 'BR', 137, 10.0),
 ('Contato de Risco', 2003, 'Nada a informar sobre Contato de Risco', 'BR', None, 2.4),
 ('Caça-Fantasmas', 2016, 'Nada a informar sobre Caça-Fantasmas', 'BR', None, None)]

Nada muda na tabela original usada para a cópia

In [208]:
%%sql

SELECT * FROM cinemav1.Filme;

 * postgresql://postgres:***@localhost:5432/est043
6 rows affected.

[('Monty Python em Busca do Cálice Sagrado', 1975, 'King Arthur and his knights embark on a low-budget search for the Grail, encountering many, very silly obstacles.', 'UK', 93, 8.3),
 ('As Pontes de Madison', 1995, 'The path of Francesca Johnson seems destined when an unexpected fork in the road causes her to question everything she had come to expect from life.', 'US', 137, 10.0),
 ('Contato de Risco', 2003, 'Nada a informar sobre Contato de Risco', 'US', None, 2.4),
 ('Caça-Fantasmas', 2016, 'Nada a informar sobre Caça-Fantasmas', 'US', None, None),
 ('A Família Bélier', 2014, 'Nada a informar sobre A Família Bélier', 'FR', None, None),
 ('Meu melhor amigo', 2006, 'Nada a informar sobre Meu melhor amigo', 'FR', 96, None)]

Copiar somente dados entre tabelas

In [201]:
%%sql

SELECT * FROM cinemav2.Pais;

 * postgresql://postgres:***@localhost:5432/est043
0 rows affected.

[]

In [202]:
%%sql

SELECT * FROM cinemav1.Filme;

 * postgresql://postgres:***@localhost:5432/est043
6 rows affected.

[('Monty Python em Busca do Cálice Sagrado', 1975, 'King Arthur and his knights embark on a low-budget search for the Grail, encountering many, very silly obstacles.', 'UK', 93, 8.3),
 ('As Pontes de Madison', 1995, 'The path of Francesca Johnson seems destined when an unexpected fork in the road causes her to question everything she had come to expect from life.', 'US', 137, 10.0),
 ('Contato de Risco', 2003, 'Nada a informar sobre Contato de Risco', 'US', None, 2.4),
 ('Caça-Fantasmas', 2016, 'Nada a informar sobre Caça-Fantasmas', 'US', None, None),
 ('A Família Bélier', 2014, 'Nada a informar sobre A Família Bélier', 'FR', None, None),
 ('Meu melhor amigo', 2006, 'Nada a informar sobre Meu melhor amigo', 'FR', 96, None)]

In [203]:
%%sql

SELECT * FROM cinemav2.Filme;

 * postgresql://postgres:***@localhost:5432/est043
0 rows affected.

[]

In [204]:
%%sql

INSERT INTO cinemav2.Pais
SELECT * FROM cinemav1.Pais;

 * postgresql://postgres:***@localhost:5432/est043
6 rows affected.

[]

A ordem das colunas de cinemav1.filme é diferente de cinemav2.filme

In [205]:
%%sql

INSERT INTO cinemav2.Filme (titulo, ano, resumo, pais, duracao, avaliacao)
SELECT * FROM cinemav1.Filme;

 * postgresql://postgres:***@localhost:5432/est043
6 rows affected.

[]

In [206]:
%%sql

SELECT * FROM cinemav2.Filme;

 * postgresql://postgres:***@localhost:5432/est043
6 rows affected.

[('Monty Python em Busca do Cálice Sagrado', 1975, 8.3, 93, 'King Arthur and his knights embark on a low-budget search for the Grail, encountering many, very silly obstacles.', 'UK'),
 ('As Pontes de Madison', 1995, 10.0, 137, 'The path of Francesca Johnson seems destined when an unexpected fork in the road causes her to question everything she had come to expect from life.', 'US'),
 ('Contato de Risco', 2003, 2.4, None, 'Nada a informar sobre Contato de Risco', 'US'),
 ('Caça-Fantasmas', 2016, None, None, 'Nada a informar sobre Caça-Fantasmas', 'US'),
 ('A Família Bélier', 2014, None, None, 'Nada a informar sobre A Família Bélier', 'FR'),
 ('Meu melhor amigo', 2006, None, 96, 'Nada a informar sobre Meu melhor amigo', 'FR')]

In [207]:
%%sql

SELECT * FROM cinemav2.Pais;

 * postgresql://postgres:***@localhost:5432/est043
6 rows affected.

[('US', 'Estados Unidos'),
 ('UK', 'Reino Unido'),
 ('FR', 'França'),
 ('AR', 'Agentina'),
 ('NZ', 'Nova Zelândia'),
 ('BR', 'Brasil')]

# Mais testes em relação a restrições de integridade

Ellen Page foi atriz em Juno

In [218]:
%%sql

SET SCHEMA 'cinemav1';

DELETE FROM FilmeElenco WHERE nomeartista = 'Ellen Page';
DELETE FROM Artista WHERE nome = 'Ellen Page';
DELETE FROM FilmeGenero where titulofilme = 'Juno';
DELETE FROM Filme where titulo = 'Juno';

 * postgresql://postgres:***@localhost:5432/est043
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [220]:
%%sql

INSERT INTO Artista (nome, sexo) VALUES ('Ellen Page', 'F');

INSERT INTO Filme (titulo, ano, duracao, pais, resumo)
VALUES ('Juno', 2008, 96, 'US',
'Juno MacGuff (Ellen Page) é uma jovem de 16 anos que acidentalmente engravidou de Paulie Bleeker (Michael Cera), um grande amigo com quem transou apenas uma vez. Inicialmente ela decide fazer um aborto, mas ao chegar na clínica muda de idéia. Junto com sua amiga Leah (Olivia Thirlby) ela passa a procurar em jornais um casal a quem possa entregar o bebê assim que ele nascer, já que não se considera em condições de criá-lo. É assim que conhece Vanessa (Jennifer Garner) e Mark (Jason Bateman), um casal com boas condições financeiras que está disposto a bancar todas as despesas médicas de Juno, além de dar-lhe uma compensação financeira caso ela queira. Juno recusa o dinheiro para si, mas decide que Vanessa e Mark ficarão com seu filho.');

INSERT INTO FilmeElenco (titulofilme, ano, nomeartista)
VALUES ('Juno', 2008, 'Ellen Page');

INSERT INTO FilmeGenero (titulofilme, ano, nomegenero)
VALUES ('Juno', 2008, 'Drama');

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Ellen Page assume ser trans e adota o nome artistico Elliot Page

In [221]:
%%sql

UPDATE Artista
SET nome = 'Elliot Page', sexo = 'M'
WHERE nome = 'Ellen Page';

 * postgresql://postgres:***@localhost:5432/est043
(psycopg2.errors.ForeignKeyViolation) update or delete on table "artista" violates foreign key constraint "filmeelenco_nomeartista_fkey" on table "filmeelenco"
DETAIL:  Key (nome)=(Ellen Page) is still referenced from table "filmeelenco".

[SQL: UPDATE Artista
SET nome = 'Elliot Page', sexo = 'M'
WHERE nome = 'Ellen Page';]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [216]:
%%sql

SELECT * FROM information_schema.referential_constraints WHERE constraint_schema = 'cinemav1';

 * postgresql://postgres:***@localhost:5432/est043
5 rows affected.

[('est043', 'cinemav1', 'filme_pais_fkey', 'est043', 'cinemav1', 'pais_pkey', 'NONE', 'NO ACTION', 'NO ACTION'),
 ('est043', 'cinemav1', 'filmeelenco_nomeartista_fkey', 'est043', 'cinemav1', 'artista_pkey', 'NONE', 'NO ACTION', 'NO ACTION'),
 ('est043', 'cinemav1', 'filmegenero_nomegenero_fkey', 'est043', 'cinemav1', 'genero_pkey', 'NONE', 'NO ACTION', 'NO ACTION'),
 ('est043', 'cinemav1', 'filmeelenco_titulofilme_ano_fkey', 'est043', 'cinemav1', 'filme_pkey', 'NONE', 'NO ACTION', 'NO ACTION'),
 ('est043', 'cinemav1', 'filmegenero_titulofilme_ano_fkey', 'est043', 'cinemav1', 'filme_pkey', 'NONE', 'NO ACTION', 'NO ACTION')]

In [222]:
%%sql

DELETE FROM FilmeElenco WHERE nomeartista = 'Elliot Page';
DELETE FROM Artista WHERE nome = 'Elliot Page';
DELETE FROM FilmeGenero where titulofilme = 'Lioness';
DELETE FROM Filme where titulo = 'Lioness';
DELETE FROM Genero where nome = 'Guerra';

 * postgresql://postgres:***@localhost:5432/est043
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [223]:
%%sql

INSERT INTO Artista (nome, sexo) VALUES ('Elliot Page', 'M');

INSERT INTO Filme (titulo, ano, duracao, pais, resumo)
VAlUES ('Lioness', 2025, NULL, 'US',
'Leslie Martz é um fuzileiro naval, na guerra do Afeganistão, que tem como missão estreitar relações com as mulheres locais e extrair informações sobre os seus maridos talibãs. Porém, ao longo da aproximação ela entra em conflito consigo mesma quando se questiona sobre a lealdade com seus alvos, ao mesmo tempo em que luta para manter em segredo a sua sexualidade para os seus superiores. ');

INSERT INTO FilmeElenco (titulofilme, ano, nomeartista)
VALUES ('Lioness', 2025, 'Elliot Page');

INSERT INTO Genero (nome)
VALUES ('Guerra');

INSERT INTO FilmeGenero (titulofilme, ano, nomegenero)
VALUES ('Lioness', 2025, 'Guerra');

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [224]:
%%sql

SELECT * FROM FilmeElenco;

 * postgresql://postgres:***@localhost:5432/est043
4 rows affected.

[('As Pontes de Madison', 1995, 'Maryl Streep'),
 ('As Pontes de Madison', 1995, 'Clint Eastwood'),
 ('Juno', 2008, 'Ellen Page'),
 ('Lioness', 2025, 'Elliot Page')]

In [225]:
%%sql

UPDATE FilmeElenco
SET nomeartista = 'Elliot Page'
WHERE nomeartista = 'Ellen Page';

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.

[]

In [226]:
%%sql

SELECT * FROM FilmeElenco;

 * postgresql://postgres:***@localhost:5432/est043
4 rows affected.

[('As Pontes de Madison', 1995, 'Maryl Streep'),
 ('As Pontes de Madison', 1995, 'Clint Eastwood'),
 ('Lioness', 2025, 'Elliot Page'),
 ('Juno', 2008, 'Elliot Page')]

In [227]:
%%sql

SELECT * FROM Artista WHERE nome like 'Ell%';

 * postgresql://postgres:***@localhost:5432/est043
2 rows affected.

[('Ellen Page', 'F'), ('Elliot Page', 'M')]

In [228]:
%%sql

DELETE FROM Artista WHERE nome like 'Ellen%';

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.

[]

In [229]:
%%sql

SELECT * FROM Artista WHERE nome like 'Ell%';

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.

[('Elliot Page', 'M')]

Mas podemos tratar esta mudança de genero e nome artistico de outra forma

In [230]:
%%sql

SET SCHEMA 'cinemav2';

DELETE FROM FilmeElenco WHERE nomeartista LIKE 'Ell%';
DELETE FROM Artista WHERE nome LIKE 'Ell%';
DELETE FROM FilmeGenero where titulofilme = 'Juno';
DELETE FROM Filme where titulo = 'Juno';
DELETE FROM Genero where nome = 'Drama';

 * postgresql://postgres:***@localhost:5432/est043
Done.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [231]:
%%sql

INSERT INTO Artista (nome, sexo) VALUES ('Ellen Page', 'F');

INSERT INTO Filme (titulo, ano, duracao, pais, resumo)
VALUES ('Juno', 2008, 96, 'US',
'Juno MacGuff (Ellen Page) é uma jovem de 16 anos que acidentalmente engravidou de Paulie Bleeker (Michael Cera), um grande amigo com quem transou apenas uma vez. Inicialmente ela decide fazer um aborto, mas ao chegar na clínica muda de idéia. Junto com sua amiga Leah (Olivia Thirlby) ela passa a procurar em jornais um casal a quem possa entregar o bebê assim que ele nascer, já que não se considera em condições de criá-lo. É assim que conhece Vanessa (Jennifer Garner) e Mark (Jason Bateman), um casal com boas condições financeiras que está disposto a bancar todas as despesas médicas de Juno, além de dar-lhe uma compensação financeira caso ela queira. Juno recusa o dinheiro para si, mas decide que Vanessa e Mark ficarão com seu filho.');

INSERT INTO FilmeElenco (titulofilme, ano, nomeartista)
VALUES ('Juno', 2008, 'Ellen Page');

INSERT INTO Genero VALUES ('Drama');

INSERT INTO FilmeGenero (titulofilme, ano, nomegenero)
VALUES ('Juno', 2008, 'Drama');

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [232]:
%%sql

SELECT * FROM FilmeElenco;

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.

[('Juno', 2008, 'Ellen Page')]

Ellen Page assume ser trans e adota o nome artistico Elliot Page

A tabela Artista não aceita o valor 'T' para o sexo

In [233]:
%%sql

INSERT INTO Artista (nome, sexo) VALUES ('Elliot Page', 'T');

 * postgresql://postgres:***@localhost:5432/est043
(psycopg2.errors.CheckViolation) new row for relation "artista" violates check constraint "ck_sexo_artista"
DETAIL:  Failing row contains (Elliot Page, T).

[SQL: INSERT INTO Artista (nome, sexo) VALUES ('Elliot Page', 'T');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [234]:
%%sql

UPDATE Artista
SET nome = 'Elliot Page', sexo = 'T'
WHERE nome = 'Ellen Page';

 * postgresql://postgres:***@localhost:5432/est043
(psycopg2.errors.CheckViolation) new row for relation "artista" violates check constraint "ck_sexo_artista"
DETAIL:  Failing row contains (Elliot Page, T).

[SQL: UPDATE Artista
SET nome = 'Elliot Page', sexo = 'T'
WHERE nome = 'Ellen Page';]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [236]:
%%sql

UPDATE Artista
SET nome = 'Elliot Page', sexo = 'M'
WHERE nome = 'Ellen Page';

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.

[]

In [235]:
%%sql

SELECT * FROM information_schema.referential_constraints WHERE constraint_schema = 'cinemav2';

 * postgresql://postgres:***@localhost:5432/est043
5 rows affected.

[('est043', 'cinemav2', 'fk_pais_filme', 'est043', 'cinemav2', 'pk_sigla', 'NONE', 'NO ACTION', 'NO ACTION'),
 ('est043', 'cinemav2', 'fk_artista', 'est043', 'cinemav2', 'pk_nome_artista', 'NONE', 'CASCADE', 'RESTRICT'),
 ('est043', 'cinemav2', 'fk_genero', 'est043', 'cinemav2', 'pk_nome_genero', 'NONE', 'NO ACTION', 'NO ACTION'),
 ('est043', 'cinemav2', 'fk_elencofilme', 'est043', 'cinemav2', 'pk_filme', 'NONE', 'NO ACTION', 'NO ACTION'),
 ('est043', 'cinemav2', 'fk_generofilme', 'est043', 'cinemav2', 'pk_filme', 'NONE', 'NO ACTION', 'NO ACTION')]

In [237]:
%%sql

SELECT * FROM FilmeElenco;

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.

[('Juno', 2008, 'Elliot Page')]

In [238]:
%%sql

SELECT * FROM Artista;

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.

[('Elliot Page', 'M')]

In [239]:
%%sql

INSERT INTO Filme (titulo, ano, duracao, pais, resumo)
VAlUES ('Lioness', 2025, NULL, 'US',
'Leslie Martz é um fuzileiro naval, na guerra do Afeganistão, que tem como missão estreitar relações com as mulheres locais e extrair informações sobre os seus maridos talibãs. Porém, ao longo da aproximação ela entra em conflito consigo mesma quando se questiona sobre a lealdade com seus alvos, ao mesmo tempo em que luta para manter em segredo a sua sexualidade para os seus superiores. ');

INSERT INTO FilmeElenco (titulofilme, ano, nomeartista)
VALUES ('Lioness', 2025, 'Elliot Page');

INSERT INTO Genero (nome) VALUES ('Guerra');

INSERT INTO FilmeGenero (titulofilme, ano, nomegenero)
VALUES ('Lioness', 2025, 'Guerra');

 * postgresql://postgres:***@localhost:5432/est043
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [240]:
%%sql

SELECT * FROM FilmeElenco;

 * postgresql://postgres:***@localhost:5432/est043
2 rows affected.

[('Juno', 2008, 'Elliot Page'), ('Lioness', 2025, 'Elliot Page')]